src/Cases/Validation_Edge_Transient/Canopy_half/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          18432;
        startFace       1686816;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          18432;
        startFace       1705248;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2976;
        startFace       1723680;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2976;
        startFace       1726656;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          5952;
        startFace       1729632;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          5952;
        startFace       1735584;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
)

// ************************************************************************* //
