src/Cases/Validation_Edge_Transient/Canopy_half/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-15;
        relTol          0.1;
        maxIter         10;
    }
    
    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    "(U|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.1;
    }

    "T|Moisture"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0.1;
    }
    
    "(U|T|k|epsilon|omega|R|Moisture)Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.15;
    }
    equations
    {
        U               0.1;
        k               0.3;
        omega           0.3;
        epsilon         0.3;
        T               0.1;
        Moisture        0.9;
        "(U|T|k|epsilon|omega|R)Final" 1;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
